app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", "5"]]
---
  def create
    @school_class = SchoolClass.new(post_params)
    @school_class.save

UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", "10"], ["id", 1]]
---
  def update
    @school_class = Post.find(params[:id])

   @school_class.update(post_params(:title))