app/controllers/students_controller.rb

  def create
    @student = Student.new(post_params)
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-04-28 21:42:42.064492"], ["updated_at", "2019-04-28 21:42:42.064492"]]

  def update
    @student = Student.find(params[:id])

    @student.update(post_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-04-28 22:24:15.076261"], ["id", 1]]